{
  "name": "AutoInitiative",
  "script": "AutoInitiative.js",
  "version": "1.0",
  "previousversions": [],
  "description": "Roll initiative for all NPCs with just one click! Simply open the turn order and initiatives for all NPC tokens on the player page are automatically rolled and added to the turn order.\n\nYou can group monsters of the same type or have each monster's initiative rolled separately. You can also specify a maximum number of monsters per group. Monsters of the same type will be divided into subgroups and assigned color-coordinated status markers. For example, if you have 12 goblins and set the group max to 4, the script will create three groups of 4 goblins, roll initiative for each group, and assign each token a color marker so you can easily identify which goblin belongs to which group.\n\nSettings can be configured with commands, but also with an easy to use menu that allows you to set options with just one click.\n## Commands\n* `!autoinit` - sends the settings menu to the Roll20 chat. Contains clickable options.\n* `!autoinit --recover` - accidentally close the turnorder? Do not panic. Simply re-open the turn order and use this command to restore the previous turn order.\n* `!autoinit --clear` - removes the color markers assigned to subgroups.\n* `!autoinit --enable [true|false]` - enables or disables Auto Initiative.\n* `autoinit --help` - displays command usage.\n## Options\n* `!autoinit --group [true|false]` - whether to group monsters of the same type or roll individually.\n* `!autoinit --output [true|false]` - whether to send initiative rolls to the Roll20 chat.\n* `!autoinit --players [true|false]` - whether to roll initiative for player characters in addition to NPCs.\n* `!autoinit --max [number|none]` - maximum number of tokens allowed per group. If group limit is exceeded tokens are placed into color-coordinated subgroups.",
  "authors": "Megan W.",
  "roll20userid": "3004169",
  "useroptions": [],
  "dependencies": [],
  "modifies": {
    "state.AutoInitiative": "read,write",
    "token.statusmarkers": "read,write",
    "campaign.turnorder": "read,write"
  },
  "conflicts": []
}
